app/controllers/vacations_controller.rb

  def index
    @user = current_user
    @vacations = Vacation.all
---
SELECT "vacations".* FROM "vacations"

  def create
    @vacation = Vacation.new(vacation_params)

    respond_to do |format|
      if @vacation.save
---
INSERT INTO "vacations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "My Vacation"], ["created_at", "2016-06-14 19:19:21.044125"], ["updated_at", "2016-06-14 19:19:21.044125"]]

  def destroy
    @vacation.destroy
---
DELETE FROM "vacations" WHERE "vacations"."id" = $1  [["id", 1]]

    def set_vacation
      @vacation = Vacation.find(params[:id])
---
SELECT  "vacations".* FROM "vacations" WHERE "vacations"."id" = $1 LIMIT 1  [["id", 1]]